{
  "backend/main.mo": "Motoko backend implementing user profiles, RBAC-checked actions, and trip creation/join logic with map-based storage.",
  "feature_evidence.json": "Structured feature evidence report mapping implemented features to files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of frontend file paths with short human‑written summaries of each component or page.",
  "frontend/index.css": "Empty CSS file placeholder.",
  "frontend/index.html": "Basic HTML shell loading the React app entrypoint.",
  "frontend/src/App.tsx": "Main router and layout logic handling authentication, profile setup, and routing to all app pages.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Admin-only access denial screen with navigation back to home.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with loading and error handling.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Mandatory first‑time profile setup modal allowing users to submit their name.",
  "frontend/src/components/layout/AppShell.tsx": "Layout component providing navigation, responsive mobile menu, and admin-only links based on user role.",
  "frontend/src/components/travel/TripFormDialog.tsx": "Dialog form for creating a new trip, validating inputs and submitting data via useCreateTrip.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor based on identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hooks for Internet Identity authentication, managing login state and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, roles, admin checks, and travel pool trips.",
  "frontend/src/index.css": "Tailwind CSS base file defining theme variables, light/dark color tokens, and global styles.",
  "frontend/src/lib/travel/emissions.ts": "Utility to calculate carbon emissions per trip using distance, vehicle type, and passenger count.",
  "frontend/src/main.tsx": "Application entry point wiring QueryClient, InternetIdentityProvider, global styles, and rendering App.",
  "frontend/src/pages/AdminAuditLogPage.tsx": "Admin-only page showing a placeholder audit log or access denied if user lacks privileges.",
  "frontend/src/pages/AdminNoticesPage.tsx": "Admin-only page showing placeholder UI for managing timetable notices.",
  "frontend/src/pages/AdminSafetyReportsPage.tsx": "Admin-only page displaying a placeholder section for reviewing safety reports.",
  "frontend/src/pages/EmailSummarizerPage.tsx": "Page for pasting email content and running a client-side heuristic analysis to generate summaries and metadata.",
  "frontend/src/pages/LoginPage.tsx": "Landing page with Internet Identity login and feature overview cards.",
  "frontend/src/pages/MessMenuPage.tsx": "Page showing a placeholder for the daily mess menu feature.",
  "frontend/src/pages/PrivacyPage.tsx": "Static page describing data storage, visibility, and admin access policies.",
  "frontend/src/pages/SettingsPage.tsx": "User settings page allowing profile edits, interests management, and saving updates.",
  "frontend/src/pages/TimetablePage.tsx": "Page with placeholder UI for managing and viewing a personal timetable.",
  "frontend/src/pages/TravelPoolPage.tsx": "Travel pool listing page showing existing trips, creation options, and trip details links.",
  "frontend/src/pages/TravelTripDetailsPage.tsx": "React page that displays trip details, handles join/delete actions, and shows loading or not‑found states using hooks and UI components.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and cleaning them from hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS config extending colors, animations, container settings, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Project state metadata describing features, architecture notes, images, and versioning for a campus companion app."
}
